In [3]:
import pandas as pd

In [4]:
data = pd.read_csv(r'D:\coding\ML\Machine learning\campus prediction\Placement_Data_Full_Class.csv')

In [5]:
data.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [6]:
data.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [7]:
data = pd.get_dummies(data, drop_first=True)

In [8]:
data = data.iloc[:, 1:]

In [9]:
data.head()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary,gender_M,ssc_b_Others,hsc_b_Others,hsc_s_Commerce,hsc_s_Science,degree_t_Others,degree_t_Sci&Tech,workex_Yes,specialisation_Mkt&HR,status_Placed
0,67.00,91.00,58.00,55.0,58.80,270000.0,1,1,1,1,0,0,1,0,1,1
1,79.33,78.33,77.48,86.5,66.28,200000.0,1,0,1,0,1,0,1,1,0,1
2,65.00,68.00,64.00,75.0,57.80,250000.0,1,0,0,0,0,0,0,0,0,1
3,56.00,52.00,52.00,66.0,59.43,NaN,1,0,0,0,1,0,1,0,1,0
4,85.80,73.60,73.30,96.8,55.50,425000.0,1,0,0,1,0,0,0,0,0,1

In [10]:
data = data.drop(['salary'], axis =1)

In [11]:
# import seaborn as sns
# sns.heatmap(data.corr(), vmin=-1, vmax=1, linewidths=.5)

In [12]:
data.corrwith(data['status_Placed']).sort_values(ascending=False)

status_Placed            1.000000
ssc_p                    0.607889
hsc_p                    0.491228
degree_p                 0.479861
workex_Yes               0.276060
etest_p                  0.127639
gender_M                 0.090670
mba_p                    0.076922
ssc_b_Others             0.037297
hsc_s_Commerce           0.024414
hsc_b_Others             0.016945
degree_t_Sci&Tech        0.008688
hsc_s_Science            0.007279
degree_t_Others         -0.117232
specialisation_Mkt&HR   -0.250655
dtype: float64

In [13]:
y = data['status_Placed']

In [14]:
y.head()

0    1
1    1
2    1
3    0
4    1
Name: status_Placed, dtype: uint8

In [15]:
x = data.drop('status_Placed',axis =1)

In [16]:
x.head()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,gender_M,ssc_b_Others,hsc_b_Others,hsc_s_Commerce,hsc_s_Science,degree_t_Others,degree_t_Sci&Tech,workex_Yes,specialisation_Mkt&HR
0,67.00,91.00,58.00,55.0,58.80,1,1,1,1,0,0,1,0,1
1,79.33,78.33,77.48,86.5,66.28,1,0,1,0,1,0,1,1,0
2,65.00,68.00,64.00,75.0,57.80,1,0,0,0,0,0,0,0,0
3,56.00,52.00,52.00,66.0,59.43,1,0,0,0,1,0,1,0,1
4,85.80,73.60,73.30,96.8,55.50,1,0,0,1,0,0,0,0,0

In [17]:
import matplotlib.pyplot as plt
%matplotlib inline

In [18]:
# x1 = np.arange(len(labels))  # the label locations
# width = 0.35
# plt.bar('gender', width, label= 'gender')

In [19]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=3)

In [20]:
x_train.head()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,gender_M,ssc_b_Others,hsc_b_Others,hsc_s_Commerce,hsc_s_Science,degree_t_Others,degree_t_Sci&Tech,workex_Yes,specialisation_Mkt&HR
58,74.0,62.00,68.0,74.0,57.99,1,0,1,0,1,0,0,0,0
199,69.0,65.00,57.0,73.0,55.80,1,1,1,1,0,0,0,0,1
105,59.0,64.00,58.0,85.0,55.30,1,0,1,0,1,0,1,0,1
64,80.0,73.00,75.0,61.0,58.78,1,1,1,1,0,0,0,0,0
41,74.0,63.16,65.0,65.0,69.76,0,1,1,1,0,0,0,1,1

In [21]:
x_test.head()

,ssc_p,hsc_p,degree_p,etest_p,mba_p,gender_M,ssc_b_Others,hsc_b_Others,hsc_s_Commerce,hsc_s_Science,degree_t_Others,degree_t_Sci&Tech,workex_Yes,specialisation_Mkt&HR
207,83.33,78.0,61.00,88.56,71.55,1,0,1,1,0,0,0,1,0
25,52.58,54.6,50.20,76.00,65.33,0,1,0,1,0,0,0,1,0
164,67.16,72.5,63.35,53.04,65.52,0,0,0,1,0,0,0,0,0
109,52.00,63.0,65.00,86.00,56.09,1,0,1,0,1,0,1,1,1
83,84.00,79.0,68.00,84.00,66.69,1,1,1,0,1,0,1,1,0

In [22]:
y_train.head()

58     1
199    1
105    0
64     1
41     0
Name: status_Placed, dtype: uint8

In [23]:
y_test.head()

207    1
25     0
164    1
109    0
83     1
Name: status_Placed, dtype: uint8

In [24]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model_fit= model.fit(x_train, y_train)
model_fit

DecisionTreeClassifier()

In [25]:
model_predict= model.predict(x_test)

In [26]:
from sklearn.metrics import accuracy_score
Des_acc = accuracy_score(model_predict, y_test)

In [27]:
from sklearn.ensemble import RandomForestClassifier
model1 = RandomForestClassifier()
model1.fit(x_train, y_train)

RandomForestClassifier()

In [28]:
ran_predict = model1.predict(x_test)

In [29]:
accuracy_score(ran_predict, y_test)

0.8837209302325582

In [30]:
from sklearn.metrics import precision_score, confusion_matrix, f1_score, recall_score
ran_precision = precision_score(y_test, ran_predict)

In [31]:
ran_matrics = confusion_matrix(y_test, ran_predict)

In [32]:
ran_f1 = f1_score(y_test, ran_predict)

In [33]:
ran_recall = recall_score(y_test, ran_predict)

In [34]:
des_precision = precision_score(y_test, ran_predict)
des_matrics = confusion_matrix(y_test, ran_predict)
des_f1 = f1_score(y_test, ran_predict)
des_recall = recall_score(y_test, ran_predict)

In [35]:
print('Decision tree confusion matrics:, ', des_matrics)
print('Decision tree precision: ', des_precision)
print('Decision tree recall: ', des_recall)
print('Decision tree f1_score: ', des_f1)
print('accuracy: %.3f', Des_acc)

Decision tree confusion matrics:,  [[11  3]
 [ 2 27]]
Decision tree precision:  0.9
Decision tree recall:  0.9310344827586207
Decision tree f1_score:  0.9152542372881356
accuracy: %.3f 0.813953488372093

In [36]:
from sklearn.model_selection import StratifiedShuffleSplit
sss = StratifiedShuffleSplit(n_splits=10,test_size=0.2, train_size=0.8, random_state=5)

In [37]:
sss.get_n_splits(x, y)

10

In [38]:
import pickle
filename = 'model.pkl'
pickle.dump(model1, open(filename, 'wb'))